Importar a biblioteca Pandas

In [1]:
import pandas as pd

DataFrame = Tabela / Excel.xlsx e .xls / csv / dictionary

In [2]:
tabela_vendas = {
    'cod_produto':['LL001', 'LP001'],
    'produto':['Livro de Lógica', 'Livro de Python'],
    'valor':[200.00, 150.00],
    'quantidade':[1, 3],
    'data_venda':['2022/09/14', '2022/09/17'],
    'loja':['Clube Letras', 'North Shopping']
}
tabela_vendas_df = pd.DataFrame(tabela_vendas)

Exibir a Tabela
-print: já usa, normal
-display: criar a tabela

In [3]:
print(tabela_vendas_df)

  cod_produto          produto  valor  quantidade  data_venda            loja
0       LL001  Livro de Lógica  200.0           1  2022/09/14    Clube Letras
1       LP001  Livro de Python  150.0           3  2022/09/17  North Shopping

Importar Planilha - Base de Dados

In [4]:
tabelaExcel = pd.read_excel('Vendas.xlsx')
display(tabelaExcel)

,cod_produto,data_venda,nome da loja,produto,qtd,valor unitário,valor final
0,1,2022-09-13,Iande,Camisa polo,100,120,12000
1,2,2022-09-13,Joquei,Cabo usb,150,250,37500
2,3,2020-09-14,iguatemi,Carregador,28,780,21840
3,4,2020-09-14,riomar,Bateria,50,240,12000
4,5,2020-09-14,parangaba,Terno Preto,60,300,18000
5,6,2020-09-15,caucaia,Camisa Preta,40,580,23200
6,7,2020-09-15,joquei,Oculos,200,60,12000
7,8,2020-09-15,north shopping,Mochila,150,140,21000
8,9,2020-09-16,iguatemi,Bolsa,600,150,90000
9,10,2020-09-16,parangaba,Café,750,80,60000

Visualização dos Dados - Métodos 
- Head : começo da tabela -> 5 primeiras linhas

In [5]:
display(tabelaExcel.head(5))

,cod_produto,data_venda,nome da loja,produto,qtd,valor unitário,valor final
0,1,2022-09-13,Iande,Camisa polo,100,120,12000
1,2,2022-09-13,Joquei,Cabo usb,150,250,37500
2,3,2020-09-14,iguatemi,Carregador,28,780,21840
3,4,2020-09-14,riomar,Bateria,50,240,12000
4,5,2020-09-14,parangaba,Terno Preto,60,300,18000

Visualização dos Dados - Métodos
- shape: contar o número de linhas e colunas

In [6]:
display(tabelaExcel.shape)

(10, 7)

Selecionar as Series = Linhas ou uma coluna

In [11]:
produto = tabelaExcel[['produto', 'qtd', 'valor unitário']]
display(produto)

        produto  qtd  valor unitário
0   Camisa polo  100             120
1      Cabo usb  150             250
2    Carregador   28             780
3       Bateria   50             240
4   Terno Preto   60             300
5  Camisa Preta   40             580
6        Oculos  200              60
7       Mochila  150             140
8         Bolsa  600             150
9          Café  750              80

Metodo .loc - selecionar as series

In [12]:
display(tabelaExcel.loc[0])

cod_produto                         1
data_venda        2022-09-13 00:00:00
nome da loja                    Iande
produto                   Camisa polo
qtd                               100
valor unitário                    120
valor final                     12000
Name: 0, dtype: object

In [14]:
vendaNort = tabelaExcel.loc[tabelaExcel['nome da loja'] == 'north shopping']
display(vendaNort)

,cod_produto,data_venda,nome da loja,produto,qtd,valor unitário,valor final
7,8,2020-09-15,north shopping,Mochila,150,140,21000